# Pandas 3

Grouby function will be explored

In [2]:
import pandas as pd

In [3]:
students = {'age'   : [10, 10, 11, 11, 11],
            'marks' : [70, 80, 80, 90, 90],
            'level' : ['1','1','2','2','3']}

df = pd.DataFrame(students)
df

   age  marks level
0   10     70     1
1   10     80     1
2   11     80     2
3   11     90     2
4   11     90     3

In [4]:
letter = df.groupby('level')  # create group object
letter.sum()

       age  marks
level
1       20    150
2       22    170
3       11     90

In [5]:
letter_level = df.groupby(['level', 'age']).sum()  #group by level, followed by age
letter_level

           marks
level age
1     10     150
2     11     170
3     11      90

In [6]:
df.nunique()  # number of unique values

age      2
marks    3
level    3
dtype: int64

In [7]:
df.level.nunique() # number of unique levels

3

In [8]:
df.groupby('level').nunique()  # unique values in each level

       age  marks
level
1        1      2
2        1      2
3        1      1